In [1]:
# https://tidyr.tidyverse.org/reference/unite.html

from datar.all import *

In [2]:
df = expand_grid(x=c("a", NA), y=c("b", NA))
df

     x    y
0    a    b
1    a  NaN
2  NaN    b
3  NaN  NaN

In [3]:
df >> unite("z", f[f.x:f.y], remove=False)

     x    y        z
0    a    b      a_b
1    a  NaN    a_nan
2  NaN    b    nan_b
3  NaN  NaN  nan_nan

In [4]:
df >> unite("z", f[f.x:f.y], na_rm=True, remove=False)

     x    y    z
0    a    b  a_b
1    a  NaN    a
2  NaN    b    b
3  NaN  NaN

In [6]:
df >> \
  unite("xy", f[f.x:f.y]) >> \
  separate(f.xy, c("x", "y"))

     x    y
0    a    b
1    a  nan
2  nan    b
3  nan  nan